app/controllers/carts_controller.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "carts" SET "status" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["status", "submitted"], ["updated_at", "2018-04-01 20:32:37.425639"], ["id", 1]]
---
  def checkout
    @cart = Cart.find(params[:id])
    @cart.checkout
    @cart.save