app/controllers/line_items_controller.rb

  def create
    current_cart.line_items << current_cart.add_item(params[:item_id])
---
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 2], ["created_at", "2018-03-30 21:47:07.325587"], ["updated_at", "2018-03-30 21:47:07.325587"]]
INSERT INTO "line_items" ("item_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["item_id", 2], ["cart_id", 11], ["created_at", "2018-03-30 22:16:49.160150"], ["updated_at", "2018-03-30 22:16:49.160150"]]