app/controllers/store_controller.rb

SELECT "categories".* FROM "categories"
SELECT "items".* FROM "items"
---
  def index
    @categories = Category.all
    @items = Item.all